11/data/attachments/d74b4ea1ac065f96.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_11588301-da1c-4fd6-9680-fbe35f805990</nif:username>
            <nif:friendToBeAdded>Phillip_check_Friend_4111_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>