9/data/attachments/7712d5d4200be7df.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:friendsRequest>
            <nif:username>soap_friends_b59bebe6-15b4-4d81-9415-b1a2745429cf</nif:username>
            
        </nif:friendsRequest>
    </soapenv:Body>
</soapenv:Envelope>