13/data/attachments/acf0a5d80941e08.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:removeFriendRequest>
            <nif:username>soap_actions_64a9584e-5c47-4125-a098-875c6c0ff435</nif:username>
            <nif:friendToBeRemoved>John_avoid_Actions_64205_0</nif:friendToBeRemoved>
        </nif:removeFriendRequest>
    </soapenv:Body>
</soapenv:Envelope>