13/data/attachments/178aa633db2a7be5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:currentUserRequest>
            <nif:username>a_user_that_has_never_existed</nif:username>
        </nif:currentUserRequest>
    </soapenv:Body>
</soapenv:Envelope>