11/data/attachments/7d8546433e3f6f81.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:allUsersRequest>
            <nif:username>soap_user_61b1b460-c628-4cad-bf5a-e1ff2c3c35ae</nif:username>
            
        </nif:allUsersRequest>
    </soapenv:Body>
</soapenv:Envelope>