10/data/attachments/2178c8945226e4e0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:declineInvitationRequest>
            <nif:username>Michelle_action_Actions_82821_7</nif:username>
            <nif:invitationToBeDeclined>soap_actions_e466355c-ac6c-4c71-a4ff-8aeb04df75bd</nif:invitationToBeDeclined>
        </nif:declineInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>