9/data/attachments/a3c03da2e26010cf.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:currentUserRequest>
            <nif:username>soap_user_fd6dfaf0-f1d9-4dd5-bc90-28d4ad81959d</nif:username>
        </nif:currentUserRequest>
    </soapenv:Body>
</soapenv:Envelope>