12/data/attachments/667424d278cf9422.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:removeFriendRequest>
            <nif:username>soap_actions_087ae82e-0f29-415c-8b0e-bfe8c0eedb26</nif:username>
            <nif:friendToBeRemoved>Shawn_other_Actions_22521_0</nif:friendToBeRemoved>
        </nif:removeFriendRequest>
    </soapenv:Body>
</soapenv:Envelope>