10/data/attachments/583bf0e68a0cc09c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:allUsersRequest>
            <nif:username>soap_user_c62d574e-afdb-47e8-9324-928ea3a3efd1</nif:username>
            
        </nif:allUsersRequest>
    </soapenv:Body>
</soapenv:Envelope>