12/data/attachments/39d29469cfd2f0fb.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:declineInvitationRequest>
            <nif:username>Kevin_campaign_Actions_67077_7</nif:username>
            <nif:invitationToBeDeclined>soap_actions_205a02d0-187f-490f-ac10-52878a534df2</nif:invitationToBeDeclined>
        </nif:declineInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>