10/data/attachments/7381d6f794dd0580.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bd8adb16-4a75-4703-bb95-923bcd3b443a</nif:username>
            <nif:friendToBeAdded>Jessica_idea_Friend_64412_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>