10/data/attachments/f06ba65673486bee.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:friendsRequest>
            <nif:username>soap_actions_e60064b1-13fa-444d-95f4-8724cdd29528</nif:username>
            
        </nif:friendsRequest>
    </soapenv:Body>
</soapenv:Envelope>