niffler_tests/internal/soap/templates/xml/remove_friend.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:nif="niffler-userdata">
    <soapenv:Body>
        <nif:removeFriendRequest>
            <nif:username>{{ username }}</nif:username>
            <nif:friendToBeRemoved>{{ friend }}</nif:friendToBeRemoved>
        </nif:removeFriendRequest>
    </soapenv:Body>
</soapenv:Envelope>
