10/data/attachments/129b33b9f660eb02.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:currentUserRequest>
            <nif:username>soap_user_fbbaa510-589b-4977-b3b2-d2555416afcf</nif:username>
        </nif:currentUserRequest>
    </soapenv:Body>
</soapenv:Envelope>