9/data/attachments/41700295af5dd92d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:allUsersRequest>
            <nif:username>soap_user_1eac6776-9ab6-4084-bac5-fa9a020becb0</nif:username>
            
        </nif:allUsersRequest>
    </soapenv:Body>
</soapenv:Envelope>